* McDowell (2020) 14CA
:PROPERTIES:
:header-args:jupyter-python+: :session ds :kernel ds
:clearpage: t
:END:

#+BEGIN_SRC bash :results verbatim :exports results
cat meta.bsv | sed 's/|/@| /' | column -s"@" -t
#+END_SRC

#+RESULTS:
#+begin_example
Name                                  | mcdowell_2021_15ca
Alternate name                        | 
Data source                           |  McDowell, I. E., Humphrey, N. F., Harper, J. T., and Meierbachtol, T. W.: The cooling signature of basal crevasses in a hard-bedded region of the Greenland Ice Sheet, The Cryosphere, 15, 897–907, https://doi.org/10.5194/tc-15-897-2021, 2021.
Drill year(s)                         | 2015
Data year(s)                          | August 2016
Longitude [°E]                        | -49.56950398
Latitude [°N]                         | 67.182104
Approximate location name             | 
Location source                       | 
Ice thickness [m]                     | 671
Ice thickness year                    | 2015
Ice thickness source                  | See raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder
Surface velocity [m yr^-1]            | 
Surface velocity year                 | 
Surface velocity source               | 
Measured from: Top, Bottom, Relative  | B
Depth of top measurement [m]          | 46
Depth of bottom measurement [m]       | 666
#+end_example

** Temperature

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Thickness

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)
 
** Location

+ Provided by Ian McDowell (see raw data file `Greenland_AblationZone_TProfiles.xlsx` in 14n folder)

** Velocity

** Data                                                 :noexport:

#+BEGIN_SRC python :exports none
import numpy as np
import pandas as pd

df_bot = pd.read_csv("meta.bsv", sep="|", index_col=0, header=None, squeeze=True)
thick = np.float(df_bot['Ice thickness [m]'])
df = pd.read_csv('data_bottom.csv')
df = df[df.columns[::-1]]  # swap from d,t to t,d
df['d'] = thick - df['d']
df.to_csv('data.csv', index=False)
#+END_SRC

#+RESULTS:
: None

#+BEGIN_SRC bash :exports results
cat data.csv | sort -t, -n -k2
#+END_SRC

#+RESULTS:
|                   t |     d |
|     -10.59312160108 |  46.0 |
| -10.918935340680001 |  66.0 |
| -11.244749080280002 |  86.0 |
|     -11.19556281988 | 106.0 |
|     -11.58387655948 | 126.0 |
|     -11.72219029908 | 146.0 |
|     -11.79800403868 | 166.0 |
| -11.811317778280001 | 186.0 |
|     -11.82463151788 | 206.0 |
| -11.837945257480001 | 226.0 |
| -11.788758997079999 | 246.0 |
|     -11.73957273668 | 266.0 |
|     -11.56538647628 | 286.0 |
| -11.453700215880001 | 306.0 |
|     -11.21701395548 | 326.0 |
| -10.917827695080002 | 346.0 |
|     -10.68114143468 | 366.0 |
|     -10.25695517428 | 386.0 |
|      -9.83276891388 | 406.0 |
|      -9.34608265348 | 426.0 |
|      -8.73439639308 | 446.0 |
|      -7.93521013268 | 466.0 |
|      -7.38602387228 | 486.0 |
|  -6.711837611880001 | 506.0 |
|      -5.91265135148 | 526.0 |
|  -5.481808221280001 | 536.0 |
|      -5.17596509108 | 546.0 |
|  -4.745121960880001 | 556.0 |
|      -4.31427883068 | 566.0 |
|      -3.94593570048 | 576.0 |
| -3.5150925702800007 | 586.0 |
| -3.0217494400800002 | 596.0 |
| -2.6534063098800003 | 606.0 |
|      -2.16006317968 | 616.0 |
| -1.7917200494799999 | 626.0 |
|      -1.42337691928 | 636.0 |
|      -1.05503378908 | 646.0 |
| -0.8116906588799999 | 656.0 |
|      -0.63084752868 | 666.0 |

